package com.arturagapov.speechmaster;

/**
 * Created by Artur Agapov on 28.07.2016.
 */
public class PhraseCreator {
    private String phrase = null;

    /*
    private String[] part1 = {"Дорогие друзья! \n", "С другой стороны ", "Равным образом ", "Не следует, однако, забывать, что ", "Таким образом, ", "Повседневная практика показывает, что ", "Уважаемые коллеги! \n", "Позвольте Вам напомнить, что ", "Также как ", "В целом, конечно, "};
    private String[] part2 = {"реализация намеченных плановых заданий ", "рамки и место обучения кадров ", "постоянный количественный рост и сфера нашей активности ", "сложившаяся структура организации ", "новая модель организационной деятельности ", "дальнейшее развитие различных форм деятельности ", "перспективное планирование ", "оптимизация основных целей ", "экономическая повестка сегоднящнего дня ", "внедрение современных подходов "};
    private String[] part3 = {"сыграет важную роль в формировании ", "требуют от нас анализа ", "требуют определения и уточнения ", "способствует подготовке и реализации ", "обеспечивает широкому кругу (специалистов) участие в формировании ", "позволяет выполнить важные задания по разработке ", "не дает нам иного выбора, кроме определения ", "вынуждает нас объективно потребовать ", "играет определяющее значение для ", "выявляет срочную потребность "};
    private String[] part4 = {"существенных финансовых и административных условий", "дальнейших направлений развития", "системы массового участия", "позиций, занимаемых участниками в отношении поставленных задач", "новых предложений", "направлений прогрессивного развития", "стандартных подходов", "нестандартных решений", "экономических и неэкономических факторов и перспектив", "инновационных методов управления процессами"};
*/
    private String[] part1 = {"ДОРОГИЕ ДРУЗЬЯ! \n", "С ДРУГОЙ СТОРОНЫ ", "РАВНЫМ ОБРАЗОМ ", "НЕ СЛЕДУЕТ, ОДНАКО, ЗАБЫВАТЬ, ЧТО ", "ТАКИМ ОБРАЗОМ, ", "ПОВСЕДНЕВНАЯ ПРАКТИКА ПОКАЗЫВАЕТ, ЧТО ", "УВАЖАЕМЫЕ КОЛЛЕГИ! \n", "ПОЗВОЛЬТЕ ВАМ НАПОМНИТЬ, ЧТО ", "ТАКЖЕ КАК ", "В ЦЕЛОМ, КОНЕЧНО, "};
    private String[] part2 = {"РЕАЛИЗАЦИЯ НАМЕЧЕННЫХ ПЛАНОВЫХ ЗАДАНИЙ ", "РАМКИ И МЕСТО ОБУЧЕНИЯ КАДРОВ ", "ПОСТОЯННЫЙ КОЛИЧЕСТВЕННЫЙ РОСТ И СФЕРА НАШЕЙ АКТИВНОСТИ ", "СЛОЖИВШАЯСЯ СТРУКТУРА ОРГАНИЗАЦИИ ", "НОВАЯ МОДЕЛЬ ОРГАНИЗАЦИОННОЙ ДЕЯТЕЛЬНОСТИ ", "ДАЛЬНЕЙШЕЕ РАЗВИТИЕ РАЗЛИЧНЫХ ФОРМ ДЕЯТЕЛЬНОСТИ ", "ПЕРСПЕКТИВНОЕ ПЛАНИРОВАНИЕ ", "ОПТИМИЗАЦИЯ ОСНОВНЫХ ЦЕЛЕЙ ", "ЭКОНОМИЧЕСКАЯ ПОВЕСТКА СЕГОДНЯЩНЕГО ДНЯ ", "ВНЕДРЕНИЕ СОВРЕМЕННЫХ ПОДХОДОВ "};
    private String[] part3 = {"СЫГРАЕТ ВАЖНУЮ РОЛЬ В ФОРМИРОВАНИИ ", "ТРЕБУЮТ ОТ НАС АНАЛИЗА ", "ТРЕБУЮТ ОПРЕДЕЛЕНИЯ И УТОЧНЕНИЯ ", "СПОСОБСТВУЕТ ПОДГОТОВКЕ И РЕАЛИЗАЦИИ ", "ОБЕСПЕЧИВАЕТ ШИРОКОМУ КРУГУ (СПЕЦИАЛИСТОВ) УЧАСТИЕ В ФОРМИРОВАНИИ ", "ПОЗВОЛЯЕТ ВЫПОЛНИТЬ ВАЖНЫЕ ЗАДАНИЯ ПО РАЗРАБОТКЕ ", "НЕ ДАЕТ НАМ ИНОГО ВЫБОРА, КРОМЕ ОПРЕДЕЛЕНИЯ ", "ВЫНУЖДАЕТ НАС ОБЪЕКТИВНО ПОТРЕБОВАТЬ ", "ИГРАЕТ ОПРЕДЕЛЯЮЩЕЕ ЗНАЧЕНИЕ ДЛЯ ", "ВЫЯВЛЯЕТ СРОЧНУЮ ПОТРЕБНОСТЬ "};
    private String[] part4 = {"СУЩЕСТВЕННЫХ ФИНАНСОВЫХ И АДМИНИСТРАТИВНЫХ УСЛОВИЙ", "ДАЛЬНЕЙШИХ НАПРАВЛЕНИЙ РАЗВИТИЯ", "СИСТЕМЫ МАССОВОГО УЧАСТИЯ", "ПОЗИЦИЙ, ЗАНИМАЕМЫХ УЧАСТНИКАМИ В ОТНОШЕНИИ ПОСТАВЛЕННЫХ ЗАДАЧ", "НОВЫХ ПРЕДЛОЖЕНИЙ", "НАПРАВЛЕНИЙ ПРОГРЕССИВНОГО РАЗВИТИЯ", "СТАНДАРТНЫХ ПОДХОДОВ", "НЕСТАНДАРТНЫХ РЕШЕНИЙ", "ЭКОНОМИЧЕСКИХ И НЕЭКОНОМИЧЕСКИХ ФАКТОРОВ И ПЕРСПЕКТИВ", "ИННОВАЦИОННЫХ МЕТОДОВ УПРАВЛЕНИЯ ПРОЦЕССАМИ"};


    public void createPhrase() {

        int slovo1 = (int) (Math.random() * part1.length);
        int slovo2 = (int) (Math.random() * part2.length);
        int slovo3 = (int) (Math.random() * part3.length);
        int slovo4 = (int) (Math.random() * part4.length);
        phrase = part1[slovo1] + part2[slovo2] + part3[slovo3] + part4[slovo4];
    }

    public String getPhrase() {
        return phrase;
    }
}
